function filterName(str){
    if(str.indexOf('资源')>-1 || str.indexOf('会所')>-1 || str.indexOf('论坛')>-1 || str.indexOf('兼职')>-1 || str.indexOf('家庭')>-1 || str.indexOf('进群')>-1){
        return false
    }else{
        return true
    }
}

//获取订单编号
function getOrderNo(m) {
    m = m > 13 ? 13 : m;
    var num = new Date().getTime();
    var order_no = num.toString().substring(13 - m);
    return order_no;
}

//获取随机字符串
function randomString(len) {
　　len = len || 170;
    var str = ""
　　for (i = 0; i < len; i++) {
        str += getRandomNormalWord()
　　}
　　return str;
}

function getRandomNormalWord() {
    var str = "一箭穿心火上浇油目瞪口呆白纸黑字画蛇添足德高望重举两得积少成多开膛破肚九牛毛苦婆镜圆雕虫小技海底捞针石天惊五十如虎翼三意病从入鸡飞狗叫方夜谭粗中有细急跳墙正下怀半壁江山灯红酒绿四脚朝金屋藏娇话里弓之鸟应外合接二连事功倍吃扒祸出锦花井蛙干净腾云驾雾八仙过在不堪大材用柳暗明无生门而身首异处胆包对弹琴血肉模糊光色声东击西骂若木张颠倒笑刀官相护扬眉吐气直快此数是非可圈点面指鹿为马雪送炭长短说羊六甲手遮见当头棒喝先礼后兵堆皆空胸竹依人群龙睛鼠宽宏量枪贼喊捉吁叹黄肌瘦甘拜风谈死瞑滥竽充茶淡饭阴差阳错狭路逢军令誓盟物以类聚偏概全命悬线行尸走失前蹄独具慧眼僧粥自其比双弦分臂顺牵体投地旭日升劳燕怒放水覆难收居临来历落喷远锋蹈辙披星戴月普同庆轰烈废篇横冲撞满园春形影离雨舟隐现城土立竿狐假威世代传偷摸南辕北笔墨砚夸父追效卷益肝肠寸断绝善男信女度年退避舍借消愁太平文加网拨乱反与伦俯称臣抱薪救归寡敌众翻力河拆桥烧恩背道驰患百步杨尾参齐跌貌神知解喜降曲工各美蒸并驱梁君子到止管糖衣炮章取义波折塌涂发鬓崇峻岭耳赤沧粟叶公好弥谎愿者钩败俱伤树帜招和丽藕丝似玉鸦雀爱及乌刻求剑挑钱杯孙林汉再起想争游内滴妙牢茅塞顿脸环肥坐观每况愈请瓮秋鱼将拍案畏洞房烛照猫丢浪回至床梦逆受安捧腹晴霹雳载歌舞食母截七零节枝作乐寄篱渐佳境莫名闭思才闻卑亢暮楚界广稀崩析音唇亡齿寒待闺哭千弃戎卧尝垂涎尺冒丈改换障屈去楼辟掩崖勒厢情凤麟角家交憎辩抛砖引词胜徒泰压顶汗流浃结舌置番次缓计累进即毡岸万念灰识丁闲野鹤卖国荣左右表稳庭市鬼窃私语窍烟妻散时偶酸甜辣遁沉迫睫仗势欺穷困潦裁然恙蠢欲动棱续貂旁厚薄彼翁痛痒深测紫变存青獠牙蒜皮螳车珠倾歪扭泉涌蛛迹舐犊斗承转震窜隔靴搔昂阔乳融巧言簧坚贞残罗锥苍推就眸蝉脱壳襟肘轻缝缺缄漆团算盘的矢除理濡沫羹冷炙插绕束阁尽粮偿边诗教绽议嗤鼻岁友化整等岂拿丧蝇利低危旦夕问拔弩例凹凸药热卸磨杀驴没找瞎冤必"
    return str[Math.floor(Math.random()*str.length)]
}

module.exports = {filterName,getOrderNo,randomString}

